{
  "success": true,
  "data": [
    {
      "date": "2024-02-11",
      "user_name": "SatisfiedTraveler",
      "user_image": "https://static.dw.com/image/44777236_804.jpg",
      "review_text": "I had an amazing experience staying at this structure. The staff were incredibly friendly and accommodating. The room was clean and comfortable, and the location was convenient for exploring the area. I would highly recommend it!",
      "star_count": 5
    },
    {
      "date": "2024-02-10",
      "user_name": "AdventureSeeker123",
      "user_image": "https://static.dw.com/image/44777236_804.jpg",
      "review_text": "I had a fantastic time here! The architecture is stunning and the facilities are top-notch. The view from my room was breathtaking. The staff were attentive and made sure I had everything I needed throughout my stay. Definitely worth the visit!",
      "star_count": 5
    },
    {
      "date": "2024-02-09",
      "user_name": "BusinessTraveler22",
      "user_image": "https://static.dw.com/image/44777236_804.jpg",
      "review_text": "Great place for a business trip! The meeting rooms were well-equipped, and the Wi-Fi was reliable. The location was convenient for accessing local businesses. The staff were professional and provided excellent service. I would definitely stay here again for work.",
      "star_count": 4.4
    },
    {
      "date": "2024-02-08",
      "user_name": "FamilyVacationFun",
      "user_image": "https://static.dw.com/image/44777236_804.jpg",
      "review_text": "We had a wonderful family vacation at this structure! The kids loved the pool and recreational facilities. The rooms were spacious and clean, and the staff went above and beyond to make our stay enjoyable. We'll definitely be back!",
      "star_count": 5
    },
    {
      "date": "2024-02-07",
      "user_name": "OutdoorEnthusiast",
      "user_image": "https://static.dw.com/image/44777236_804.jpg",
      "review_text": "This place exceeded my expectations! The outdoor activities available were fantastic. I enjoyed hiking and exploring the nearby trails. The room was comfortable, and the staff were friendly and helpful. I can't wait to come back!",
      "star_count": 5
    },
    {
      "date": "2024-02-06",
      "user_name": "LuxuryTraveler789",
      "user_image": "https://static.dw.com/image/44777236_804.jpg",
      "review_text": "Absolute luxury! From the moment I arrived, I was impressed by the attention to detail and the quality of service. The room was exquisite, with stunning views and luxurious amenities. The staff anticipated my every need. A truly indulgent experience!",
      "star_count": 5
    },
    {
      "date": "2024-02-05",
      "user_name": "SoloExplorer",
      "user_image": "https://static.dw.com/image/44777236_804.jpg",
      "review_text": "As a solo traveler, I felt completely at ease here. The staff were friendly and welcoming, and the atmosphere was relaxed. The location was perfect for exploring the city. I appreciated the thoughtful touches in the room. Highly recommended for solo adventurers!",
      "star_count": 4
    },
    {
      "date": "2024-02-04",
      "user_name": "CouplesGetaway",
      "user_image": "https://static.dw.com/image/44777236_804.jpg",
      "review_text": "My partner and I had a wonderful romantic getaway at this structure. The ambiance was perfect for a couples retreat. We enjoyed the cozy room, the delicious dining options, and the romantic walks in the nearby park. The staff were attentive and made our stay memorable.",
      "star_count": 5
    },
    {
      "date": "2024-02-11",
      "user_name": "DisappointedGuest",
      "user_image": "https://static.dw.com/image/44777236_804.jpg",
      "review_text": "Extremely disappointed with my stay. The room was dirty upon arrival, with stains on the carpet and a musty odor. The staff were unhelpful and seemed indifferent to my concerns. The amenities were subpar, and the overall experience was far below expectations.",
      "star_count": 1
    },
    {
      "date": "2024-02-10",
      "user_name": "UnsatisfiedCustomer123",
      "user_image": "https://static.dw.com/image/44777236_804.jpg",
      "review_text": "Not worth the price. The room was cramped and outdated, with uncomfortable furniture. The noise from neighboring rooms kept me up at night, and the walls were paper-thin. The staff were unfriendly and unresponsive to my complaints. Would not recommend.",
      "star_count": 2
    },
    {
      "date": "2024-02-09",
      "user_name": "RegretfulTraveler",
      "user_image": "https://static.dw.com/image/44777236_804.jpg",
      "review_text": "Regret staying at this structure. The cleanliness standards were lacking, with mold in the bathroom and dirty linens. The location was inconvenient, with limited dining options nearby. The staff were rude and unprofessional. Will not be returning.",
      "star_count": 1
    },
    {
      "date": "2024-02-08",
      "user_name": "DisgruntledGuest456",
      "user_image": "https://static.dw.com/image/44777236_804.jpg",
      "review_text": "Highly disappointed with the service. The room was not ready upon check-in, despite arriving late in the evening. The air conditioning was broken, making the room unbearably hot. The staff were unapologetic and offered no compensation for the inconvenience.",
      "star_count": 2
    },
    {
      "date": "2024-02-07",
      "user_name": "FrustratedVisitor789",
      "user_image": "https://static.dw.com/image/44777236_804.jpg",
      "review_text": "Frustrating experience overall. The structure was understaffed, leading to long wait times for service. The room was poorly maintained, with peeling wallpaper and a malfunctioning shower. The advertised amenities were either unavailable or in poor condition. Not worth the money.",
      "star_count": 2
    }
  ]
}
